tutorials/incompressible/icoDyMFoam/movingConeTopo/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMeshLibs   1("libtopoChangerFvMesh.so");

dynamicFvMesh      movingConeTopoFvMesh;

movingConeTopoFvMeshCoeffs
{
    motionVelAmplitude      (0.00051 0 0);
    motionVelPeriod         10;

    leftEdge                -0.0075;
    leftObstacleEdge        -0.007;
    rightObstacleEdge       -0.0035;

    left
    {
        minThickness        2e-4;
        maxThickness        5e-4;
    }

    right
    {
        minThickness        2e-4;
        maxThickness        5e-4;
    }
}

// ************************************************************************* //
